using System.Collections.Generic;

namespace Galchonok
{
    public class LibA
    {
        public readonly List<List<ChapterA>> BookList = new List<List<ChapterA>>()
        {
            new List<ChapterA>(){
                new ChapterA( "кто",
                    new List<string> { "мама", "папа", "мальчик", "девочка", "бабушка", "дедушка", "собака", "кошка", "лошадь", "учитель", "доктор", "космонавт", "балерина", "водитель", "полицейский", "уборщик", "сосед", "друг", "подруга", "соседка", "продавец", "продавщица", "парикмахер", "кассир", "танцор", "певец" }
                )
            },

            new List<ChapterA>(){
                new ChapterA( "что",
                    new List<string>{ "музыка", "вода", "машина", "троллейбус", "трамвай", "метро", "банан", "яблоко", "картошка" }
                )
            },

            new List<ChapterA>(){
                new ChapterA( "что делает",
                    new List<string>{ "играет", "пишет", "читает", "идёт", "бежит", "ищет", "смотрит", "гуляет", "сажает", "умеет", "делает", "кричит", "плачет", "может", "просит", "говорит", "спрашивает", "учится", "прыгает", "видит" }
                ),

                new ChapterA( "что делают",
                    new List<string>{ "играют", "пишут", "читают", "идут", "бегут", "ищут", "смотрят", "гуляют", "сажают", "умеют", "делают", "кричат", "плачут", "могут", "просят", "говорят", "спрашивают", "учатся", "прыгают", "видят" }
                ),

                new ChapterA( "что сделал",
                    new List<string>{ "поиграл", "написал", "почитал", "пришел", "прибежал", "нашел", "посмотрел", "погулял", "посадил", "сумел", "сделал", "покричал", "поплакал", "смог", "попросил", "сказал", "сросил", "научился", "прыгнул", "увидел" }
                ),

                new ChapterA( "что сделала",
                    new List<string>{ "наигралась", "подписала", "прочитала", "пришла", "прибежала", "нашла", "посмотрела", "погуляла", "посадила", "сумела", "сделала", "накричалась", "наплакалась", "смогла", "попросила", "поговорила", "спросила", "научилась", "прыгнула", "увидела" }
                ),

                new ChapterA( "что сделали",
                    new List<string>{ "наигрались", "написали", "прочитали", "пришли", "прибежали", "нашли", "посмотрели", "погуляли", "посадили", "сумели", "сделали", "покричали", "поплакали", "смогли", "попросили", "поговорили", "спросили", "научились", "прыгнули", "увидели" }
                )
            },

            new List<ChapterA>(){
                new ChapterA( "какой",
                    new List<string>{ "большой", "маленький", "красивый", "умный", "хороший", "плохой", "круглый", "зелёный", "красный", "жёлтый", "синий", "белый", "чёрный", "коричневый", "злой", "добрый", "глупый", "высокий", "низкий", "тяжёлый", "лёгкий", "твёрдый", "мягкий", "старый", "молодой", "грустный", "весёлый", "сердитый" }
                )
            },

            new List<ChapterA>(){
                new ChapterA( "где",
                    new List<string>{ "в школе", "дома", "на улице", "на горке", "на площадке", "в магазине", "в зоопарке", "на кассе", "в кафе", "в туалете", "в ванной", "в комнате", "в кабинете" }
                )
            },

            new List<ChapterA>(){
                new ChapterA( "когда",
                    new List<string>{ "вчера", "завтра", "сегодня", "потом", "сначала", "позже", "раньше", "в понедельник", "во вторник", "в среду", "в четверг", "в пятницу", "в субботу", "в воскресенье", "в январе", "в феврале", "в марте", "в апреле", "в мае", "в июне", "в июле", "в августе", "в сентябре", "в октябре", "в ноябре", "в декабре" }
                )
            },
        };
    }
}